Tekla Open API Reference for Tekla Structures 2025
BentPlateGeometrySolver.ModifyCylindricalSurface Method
 Modifies the shape of a cylindrical surface section, and updates related polygon sections accordingly.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ConnectiveGeometry ModifyCylindricalSurface(
	ConnectiveGeometry geometry,
	GeometrySection cylindricalSection,
	CylindricalSurface surface
)
Public Function ModifyCylindricalSurface (
	geometry As ConnectiveGeometry,
	cylindricalSection As GeometrySection,
	surface As CylindricalSurface
) As ConnectiveGeometry
Parameters
geometry
Type: Tekla.Structures.Model.ConnectiveGeometry
[Missing <param name="geometry"/> documentation for "M:Tekla.Structures.Model.BentPlateGeometrySolver.ModifyCylindricalSurface(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Model.GeometrySection,Tekla.Structures.Model.CylindricalSurface)"]
cylindricalSection
Type: Tekla.Structures.Model.GeometrySection
[Missing <param name="cylindricalSection"/> documentation for "M:Tekla.Structures.Model.BentPlateGeometrySolver.ModifyCylindricalSurface(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Model.GeometrySection,Tekla.Structures.Model.CylindricalSurface)"]
surface
Type: Tekla.Structures.Model.CylindricalSurface
[Missing <param name="surface"/> documentation for "M:Tekla.Structures.Model.BentPlateGeometrySolver.ModifyCylindricalSurface(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Model.GeometrySection,Tekla.Structures.Model.CylindricalSurface)"]
Return Value
Type: ConnectiveGeometry
[Missing <returns> documentation for "M:Tekla.Structures.Model.BentPlateGeometrySolver.ModifyCylindricalSurface(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Model.GeometrySection,Tekla.Structures.Model.CylindricalSurface)"]
Remarks
 Identical to ModifyBendSurface(ConnectiveGeometry, GeometrySection, BendSurface)
See Also
Reference
BentPlateGeometrySolver Class
Tekla.Structures.Model Namespace